In [1]:
import pandas as pd

In [21]:
df = pd.read_csv('D:/Descargas/empleados.csv', delimiter = ";") # Esta linea carga al df (DataFrame) el archivo .csv y lo delimita mediante los ';'.
# Se debe cambiar la ruta especificada.

In [15]:
pd.set_option('display.max_columns', None) # Estos ajusten sacan los limites de la muestra de los datos tanto de las rows como de las columnas
pd.set_option('display.max_rows', None)    # Para que el DataFrame se muestre sin truncamiento.

In [17]:
df.head() # Mostramos los primeros cinco casos

,Nombre,Apellido,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento
0,Alexandro,NaN,Masculino,Soltero(a),22.0,3.0,2423.0,No,Publicidad
1,Carlos,NaN,Masculino,Casado(a),38.0,10.0,3132.0,Sí,NaN
2,Felipa,NaN,Femenino,Soltero(a),26.0,5.0,2639.0,No,Comercial
3,Daniel,NaN,Masculino,Casado(a),35.0,10.0,3122.0,No,Comercial
4,John,NaN,Masculino,Casado(a),35.0,13.0,3431.0,Sí,Servicios al cliente

In [18]:
df.shape # Recuento de las rows y columnas respectivamente

(251, 9)

In [19]:
df.isnull().sum() # Valores NaN o None en las respectiva columnas. La función '.sum()' suma los casos

Nombre            6
Apellido        251
Sexo             37
Estado_Civil      4
Edad             61
Experiencia       4
Salario           6
Gerencia         21
Departamento     12
dtype: int64

In [20]:
df.notnull().sum()  # Valores en las respectiva columnas. La función '.sum()' suma los casos

Nombre          245
Apellido          0
Sexo            214
Estado_Civil    247
Edad            190
Experiencia     247
Salario         245
Gerencia        230
Departamento    239
dtype: int64

In [28]:
df.head()

,Nombre,Apellido,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento
0,Alexandro,NaN,Masculino,Soltero(a),22.0,3.0,2423.0,No,Publicidad
1,Carlos,NaN,Masculino,Casado(a),38.0,10.0,3132.0,Sí,NaN
2,Felipa,NaN,Femenino,Soltero(a),26.0,5.0,2639.0,No,Comercial
3,Daniel,NaN,Masculino,Casado(a),35.0,10.0,3122.0,No,Comercial
4,John,NaN,Masculino,Casado(a),35.0,13.0,3431.0,Sí,Servicios al cliente